# Задача 10: На столе лежат n монеток. 
# Некоторые из них лежат вверх решкой, 
# а некоторые – гербом. Определите минимальное 
# число монеток, которые нужно перевернуть, 
# чтобы все монетки были повернуты вверх одной 
# и той же стороной. Выведите минимальное количество 
# монет, которые нужно перевернуть


# n = int(input("Введите общее количество монет: "))
# avers = int(input("Введите монет, которые лежат вверх решкой: "))
# revers = n - avers
# if avers > revers:
#     print(f"Минимальное количество момент, которые необходимо перевернуть, составляет {revers}")
# elif avers == revers:
#     print(f"Минимальное количество момент, которые необходимо перевернуть, составляет {revers}")
# else:
#     print(f"Минимальное количество момент, которые необходимо перевернуть, составляет {avers}")


# Задача 12: Петя и Катя – брат и сестра. 
# Петя – студент, а Катя – школьница. 
# Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает 
# две подсказки. Он называет сумму этих чисел S и их произведение P. 
# Помогите Кате отгадать задуманные Петей числа.


# summ = int(input("Какая сумма чисел озвучена Петей? "))
# mult = int(input("Какое произведение чисел озвучено Петей? "))
# for x in range(summ):
#     for y in range(mult):
#         if summ == x + y and mult == x *y:
#             print(f"Петя загадал числа: {x} и {y}")




# Задача 14: Требуется вывести все целые степени 
# двойки (т.е. числа вида 2k), не превосходящие числа N

# n = int(input("Введите число N: "))
# k = 0
# while 2 ** k <= n:
#     print(2**k)
#     k += 1
    

